## Plan Result (sbox_aria - Terraform Plan Apply)




<pre><code>Plan: 8 to add, 84 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.client_id[&#34;00&#34;]
  * azurerm_key_vault_secret.client_id[&#34;02&#34;]
  * azurerm_key_vault_secret.client_secret[&#34;00&#34;]
  * azurerm_key_vault_secret.client_secret[&#34;02&#34;]
  * azurerm_key_vault_secret.tenant_id[&#34;00&#34;]
  * azurerm_key_vault_secret.tenant_id[&#34;02&#34;]
  * azurerm_key_vault_secret.tenant_url[&#34;00&#34;]
  * azurerm_key_vault_secret.tenant_url[&#34;02&#34;]
* Update
  * azurerm_application_insights.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.example["00-af-apflpa-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-apflpa-sbox-uks-dlrm-01"
        name                                  = "00-af-apflpa-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-apl-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-apl-sbox-uks-dlrm-01"
        name                                  = "00-af-apl-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-apluta-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-apluta-sbox-uks-dlrm-01"
        name                                  = "00-af-apluta-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-bails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-bails-sbox-uks-dlrm-01"
        name                                  = "00-af-bails-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-joh-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-joh-sbox-uks-dlrm-01"
        name                                  = "00-af-joh-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-sbails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-sbails-sbox-uks-dlrm-01"
        name                                  = "00-af-sbails-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-td-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-td-sbox-uks-dlrm-01"
        name                                  = "00-af-td-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-apflpa-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-apflpa-sbox-uks-dlrm-01"
        name                                  = "02-af-apflpa-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-apl-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-apl-sbox-uks-dlrm-01"
        name                                  = "02-af-apl-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-apluta-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-apluta-sbox-uks-dlrm-01"
        name                                  = "02-af-apluta-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-bails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-bails-sbox-uks-dlrm-01"
        name                                  = "02-af-bails-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-joh-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-joh-sbox-uks-dlrm-01"
        name                                  = "02-af-joh-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-sbails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-sbails-sbox-uks-dlrm-01"
        name                                  = "02-af-sbails-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-td-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_application_insights" "example" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-td-sbox-uks-dlrm-01"
        name                                  = "02-af-td-sbox-uks-dlrm-01"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.client_id["00"] will be created
  + resource "azurerm_key_vault_secret" "client_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + name                    = "SERVICE-PRINCIPAL-CLIENT-ID"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.client_id["02"] will be created
  + resource "azurerm_key_vault_secret" "client_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "SERVICE-PRINCIPAL-CLIENT-ID"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.client_secret["00"] will be created
  + resource "azurerm_key_vault_secret" "client_secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + name                    = "SERVICE-PRINCIPAL-CLIENT-SECRET"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.client_secret["02"] will be created
  + resource "azurerm_key_vault_secret" "client_secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "SERVICE-PRINCIPAL-CLIENT-SECRET"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.tenant_id["00"] will be created
  + resource "azurerm_key_vault_secret" "tenant_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + name                    = "SERVICE-PRINCIPAL-TENANT-ID"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.tenant_id["02"] will be created
  + resource "azurerm_key_vault_secret" "tenant_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "SERVICE-PRINCIPAL-TENANT-ID"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.tenant_url["00"] will be created
  + resource "azurerm_key_vault_secret" "tenant_url" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + name                    = "SERVICE-PRINCIPAL-TENANT-URL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.tenant_url["02"] will be created
  + resource "azurerm_key_vault_secret" "tenant_url" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "SERVICE-PRINCIPAL-TENANT-URL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_function_app.example["00-af-apflpa-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/00-af-apflpa-sbox-uks-dlrm-01"
        name                                           = "00-af-apflpa-sbox-uks-dlrm-01"
      ~ tags                                           = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-apl-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/00-af-apl-sbox-uks-dlrm-01"
        name                                           = "00-af-apl-sbox-uks-dlrm-01"
      ~ tags                                           = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-apluta-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/00-af-apluta-sbox-uks-dlrm-01"
        name                                           = "00-af-apluta-sbox-uks-dlrm-01"
      ~ tags                                           = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-bails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/00-af-bails-sbox-uks-dlrm-01"
        name                                           = "00-af-bails-sbox-uks-dlrm-01"
      ~ tags                                           = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (34 unchanged attributes hidden)


# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

- "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["00-af-apluta-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/00-af-apluta-sbox-uks-dlrm-01"
        name                            = "00-af-apluta-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["00-af-bails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/00-af-bails-sbox-uks-dlrm-01"
        name                            = "00-af-bails-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["00-af-joh-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/00-af-joh-sbox-uks-dlrm-01"
        name                            = "00-af-joh-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["00-af-sbails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/00-af-sbails-sbox-uks-dlrm-01"
        name                            = "00-af-sbails-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["00-af-td-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/00-af-td-sbox-uks-dlrm-01"
        name                            = "00-af-td-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["02-af-apflpa-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/02-af-apflpa-sbox-uks-dlrm-01"
        name                            = "02-af-apflpa-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["02-af-apl-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/02-af-apl-sbox-uks-dlrm-01"
        name                            = "02-af-apl-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["02-af-apluta-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/02-af-apluta-sbox-uks-dlrm-01"
        name                            = "02-af-apluta-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["02-af-bails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/02-af-bails-sbox-uks-dlrm-01"
        name                            = "02-af-bails-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["02-af-joh-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/02-af-joh-sbox-uks-dlrm-01"
        name                            = "02-af-joh-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["02-af-sbails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/02-af-sbails-sbox-uks-dlrm-01"
        name                            = "02-af-sbails-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.example["02-af-td-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_service_plan" "example" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/02-af-td-sbox-uks-dlrm-01"
        name                            = "02-af-td-sbox-uks-dlrm-01"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_storage_account.example["00-af-apflpa-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/00afapflpasboxuksdlrm01"
        name                               = "00afapflpasboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["00-af-apl-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/00afaplsboxuksdlrm01"
        name                               = "00afaplsboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["00-af-apluta-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/00afaplutasboxuksdlrm01"
        name                               = "00afaplutasboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["00-af-bails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/00afbailssboxuksdlrm01"
        name                               = "00afbailssboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["00-af-joh-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/00afjohsboxuksdlrm01"
        name                               = "00afjohsboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["00-af-sbails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/00afsbailssboxuksdlrm01"
        name                               = "00afsbailssboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["00-af-td-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/00aftdsboxuksdlrm01"
        name                               = "00aftdsboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["02-af-apflpa-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/02afapflpasboxuksdlrm01"
        name                               = "02afapflpasboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["02-af-apl-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/02afaplsboxuksdlrm01"
        name                               = "02afaplsboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["02-af-apluta-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/02afaplutasboxuksdlrm01"
        name                               = "02afaplutasboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["02-af-bails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/02afbailssboxuksdlrm01"
        name                               = "02afbailssboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["02-af-joh-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/02afjohsboxuksdlrm01"
        name                               = "02afjohsboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["02-af-sbails-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/02afsbailssboxuksdlrm01"
        name                               = "02afsbailssboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.example["02-af-td-sbox-uks-dlrm-01"] will be updated in-place
  ~ resource "azurerm_storage_account" "example" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/02aftdsboxuksdlrm01"
        name                               = "02aftdsboxuksdlrm01"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 8 to add, 84 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":7,"Program":"tfcmt","SHA1":"","Target":"sbox_aria - Terraform Plan Apply","Vars":{}} -->